CSU-iMag/ArtificialIntelligenceCar/Project/MDK/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< LPUART1 signal: RX */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Device name: LPUART1 */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< LPUART1 signal: TX */

/* GPIO_SD_B1_02 (coord M3), FlexSPI_D1_B */
#define BOARD_INITPINS_STEERING_PERIPHERAL                                  PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPINS_STEERING_SIGNAL                                         A   /*!< PWM2 signal: A */
#define BOARD_INITPINS_STEERING_CHANNEL                                       3U   /*!< PWM2 A channel: 3 */

/* GPIO_AD_B1_11 (coord J13), SAI1_RX_BCLK/CSI_D6/J35[7]/J23[2] */
#define BOARD_INITPINS_AD_CH1_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH1_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH1_CHANNEL                                         0U   /*!< ADC1 IN channel: 0 */

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
#define BOARD_INITPINS_AD_CH2_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH2_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH2_CHANNEL                                         3U   /*!< ADC1 IN channel: 3 */

/* GPIO_AD_B0_15 (coord L10), CAN2_RX/U12[4] */
#define BOARD_INITPINS_AD_CH3_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH3_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH3_CHANNEL                                         4U   /*!< ADC1 IN channel: 4 */

/* GPIO_AD_B1_00 (coord J11), I2C1_SCL/CSI_I2C_SCL/J35[20]/J23[6]/U13[17]/U32[4] */
#define BOARD_INITPINS_AD_CH4_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH4_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH4_CHANNEL                                         5U   /*!< ADC1 IN channel: 5 */

/* GPIO_AD_B1_01 (coord K11), I2C1_SDA/CSI_I2C_SDA/J35[22]/J23[5]/U13[18]/U32[6] */
#define BOARD_INITPINS_AD_CH5_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH5_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH5_CHANNEL                                         6U   /*!< ADC1 IN channel: 6 */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
#define BOARD_INITPINS_AD_CH6_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH6_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH6_CHANNEL                                         8U   /*!< ADC1 IN channel: 8 */

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
#define BOARD_INITPINS_AD_CH7_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH7_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH7_CHANNEL                                         7U   /*!< ADC1 IN channel: 7 */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J35[8]/J23[3] */
#define BOARD_INITPINS_AD_CH8_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH8_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH8_CHANNEL                                         9U   /*!< ADC1 IN channel: 9 */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J35[12]/J23[4] */
#define BOARD_INITPINS_AD_CH9_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH9_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH9_CHANNEL                                        10U   /*!< ADC1 IN channel: 10 */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
#define BOARD_INITPINS_AD_CH10_PERIPHERAL                                   ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH10_SIGNAL                                         IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH10_CHANNEL                                       11U   /*!< ADC1 IN channel: 11 */

