CSU-iMag/ArtificialIntelligenceCar/Project/MDK/board/pin_mux.h
/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
#define BOARD_INITPINS_AD_CH11_PERIPHERAL                                   ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH11_SIGNAL                                         IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH11_CHANNEL                                       13U   /*!< ADC1 IN channel: 13 */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11] */
#define BOARD_INITPINS_AD_CH12_PERIPHERAL                                   ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_CH12_SIGNAL                                         IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_CH12_CHANNEL                                       14U   /*!< ADC1 IN channel: 14 */

/* GPIO_AD_B1_10 (coord L13), SAI1_RX_SYNC/CSI_D7/J35[9]/J23[1] */
#define BOARD_INITPINS_AD_BAT_PERIPHERAL                                    ADC1   /*!< Device name: ADC1 */
#define BOARD_INITPINS_AD_BAT_SIGNAL                                          IN   /*!< ADC1 signal: IN */
#define BOARD_INITPINS_AD_BAT_CHANNEL                                        15U   /*!< ADC1 IN channel: 15 */

/* GPIO_B1_13 (coord D14), WDOG_B */
#define BOARD_INITPINS_UART5_RX_PERIPHERAL                               LPUART5   /*!< Device name: LPUART5 */
#define BOARD_INITPINS_UART5_RX_SIGNAL                                        RX   /*!< LPUART5 signal: RX */

/* GPIO_B1_12 (coord D13), SD_CD_SW */
#define BOARD_INITPINS_UART5_TX_PERIPHERAL                               LPUART5   /*!< Device name: LPUART5 */
#define BOARD_INITPINS_UART5_TX_SIGNAL                                        TX   /*!< LPUART5 signal: TX */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
#define BOARD_INITPINS_LSB1_PERIPHERAL                                      TMR1   /*!< Device name: TMR1 */
#define BOARD_INITPINS_LSB1_SIGNAL                                         TIMER   /*!< TMR1 signal: TIMER */
#define BOARD_INITPINS_LSB1_CHANNEL                                           0U   /*!< TMR1 TIMER channel: 0 */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITPINS_LSB2_PERIPHERAL                                      TMR1   /*!< Device name: TMR1 */
#define BOARD_INITPINS_LSB2_SIGNAL                                         TIMER   /*!< TMR1 signal: TIMER */
#define BOARD_INITPINS_LSB2_CHANNEL                                           2U   /*!< TMR1 TIMER channel: 2 */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
#define BOARD_INITPINS_MOTOR_L_PERIPHERAL                                   PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPINS_MOTOR_L_SIGNAL                                          A   /*!< PWM1 signal: A */
#define BOARD_INITPINS_MOTOR_L_CHANNEL                                        3U   /*!< PWM1 A channel: 3 */

/* GPIO_B1_01 (coord B11), LCDIF_D13 */
#define BOARD_INITPINS_MOTOR_R_PERIPHERAL                                   PWM1   /*!< Device name: PWM1 */
#define BOARD_INITPINS_MOTOR_R_SIGNAL                                          B   /*!< PWM1 signal: B */
#define BOARD_INITPINS_MOTOR_R_CHANNEL                                        3U   /*!< PWM1 B channel: 3 */

/* GPIO_SD_B1_04 (coord P2), FlexSPI_CLK_B */
#define BOARD_INITPINS_SW3_GPIO                                            GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SW3_PORT                                            GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_SW3_PIN                                                4U   /*!< GPIO3 pin index: 4 */

/* GPIO_SD_B1_03 (coord M4), FlexSPI_D0_B */
#define BOARD_INITPINS_SW4_GPIO                                            GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SW4_PORT                                            GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_SW4_PIN                                                3U   /*!< GPIO3 pin index: 3 */

/* GPIO_SD_B1_01 (coord M5), FlexSPI_D2_B */
#define BOARD_INITPINS_SW5_GPIO                                            GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SW5_PORT                                            GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_SW5_PIN                                                1U   /*!< GPIO3 pin index: 1 */

/* GPIO_SD_B1_00 (coord L5), FlexSPI_D3_B */
#define BOARD_INITPINS_RES_GPIO                                            GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_RES_PORT                                            GPIO3   /*!< PORT device name: GPIO3 */
#define BOARD_INITPINS_RES_PIN                                                0U   /*!< GPIO3 pin index: 0 */

/* GPIO_AD_B0_00 (coord M14), USB_HOST_OC/J24[10] */
#define BOARD_INITPINS_CS_GPIO                                             GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_CS_PORT                                             GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_CS_PIN                                                 0U   /*!< GPIO1 pin index: 0 */

/* GPIO_AD_B0_01 (coord H10), USB_OTG1_ID/J24[9] */
#define BOARD_INITPINS_D1_GPIO                                             GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_D1_PORT                                             GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_D1_PIN                                                 1U   /*!< GPIO1 pin index: 1 */

/* GPIO_AD_B0_02 (coord M11), USB_OTG1_PWR/J24[2] */
#define BOARD_INITPINS_D0_GPIO                                             GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_D0_PORT                                             GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_D0_PIN                                                 2U   /*!< GPIO1 pin index: 2 */

/* GPIO_AD_B0_03 (coord G11), USB_OTG1_OC/J24[1] */
#define BOARD_INITPINS_DC_GPIO                                             GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_DC_PORT                                             GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_DC_PIN                                                 3U   /*!< GPIO1 pin index: 3 */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
#define BOARD_INITPINS_LED1_PERIPHERAL                                      PWM2   /*!< Device name: PWM2 */
#define BOARD_INITPINS_LED1_SIGNAL                                             B   /*!< PWM2 signal: B */
#define BOARD_INITPINS_LED1_CHANNEL                                           3U   /*!< PWM2 B channel: 3 */

