CSU-iMag/ArtificialIntelligenceCar/Project/MDK/board/pin_mux.h
/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
#define BOARD_INITPINS_LED2_PERIPHERAL                                      PWM4   /*!< Device name: PWM4 */
#define BOARD_INITPINS_LED2_SIGNAL                                             A   /*!< PWM4 signal: A */
#define BOARD_INITPINS_LED2_CHANNEL                                           3U   /*!< PWM4 A channel: 3 */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
#define BOARD_INITPINS_LED3_PERIPHERAL                                      GPT1   /*!< Device name: GPT1 */
#define BOARD_INITPINS_LED3_SIGNAL                                   gpt_compare   /*!< GPT1 signal: gpt_compare */
#define BOARD_INITPINS_LED3_CHANNEL                                           1U   /*!< GPT1 gpt_compare channel: 1 */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
#define BOARD_INITPINS_SW1_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SW1_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SW1_PIN                                               30U   /*!< GPIO1 pin index: 30 */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
#define BOARD_INITPINS_SW2_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SW2_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SW2_PIN                                               31U   /*!< GPIO1 pin index: 31 */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
#define BOARD_INITPINS_SDA_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SDA_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SDA_PIN                                               29U   /*!< GPIO1 pin index: 29 */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
#define BOARD_INITPINS_SCL_GPIO                                            GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SCL_PORT                                            GPIO1   /*!< PORT device name: GPIO1 */
#define BOARD_INITPINS_SCL_PIN                                               28U   /*!< GPIO1 pin index: 28 */

/* GPIO_B1_05 (coord D12), ENET_RXD1 */
#define BOARD_INITPINS_INT_GPIO                                            GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_INT_PORT                                            GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_INT_PIN                                               21U   /*!< GPIO2 pin index: 21 */

/* GPIO_B1_11 (coord C13), ENET_RXER */
#define BOARD_INITPINS_SW6_GPIO                                            GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_SW6_PORT                                            GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_SW6_PIN                                               27U   /*!< GPIO2 pin index: 27 */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
#define BOARD_INITPINS_HAL_GPIO                                            GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_HAL_PORT                                            GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_HAL_PIN                                               18U   /*!< GPIO2 pin index: 18 */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
#define BOARD_INITPINS_MOTOR_EN_GPIO                                       GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_MOTOR_EN_PORT                                       GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_MOTOR_EN_PIN                                          20U   /*!< GPIO2 pin index: 20 */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
#define BOARD_INITPINS_BEEP_PERIPHERAL                                      TMR2   /*!< Device name: TMR2 */
#define BOARD_INITPINS_BEEP_SIGNAL                                         TIMER   /*!< TMR2 signal: TIMER */
#define BOARD_INITPINS_BEEP_CHANNEL                                           3U   /*!< TMR2 TIMER channel: 3 */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITPINS_DIR1_PERIPHERAL                                      TMR1   /*!< Device name: TMR1 */
#define BOARD_INITPINS_DIR1_SIGNAL                                         TIMER   /*!< TMR1 signal: TIMER */
#define BOARD_INITPINS_DIR1_CHANNEL                                           1U   /*!< TMR1 TIMER channel: 1 */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
#define BOARD_INITPINS_DIR2_PERIPHERAL                                      TMR1   /*!< Device name: TMR1 */
#define BOARD_INITPINS_DIR2_SIGNAL                                         TIMER   /*!< TMR1 signal: TIMER */
#define BOARD_INITPINS_DIR2_CHANNEL                                           3U   /*!< TMR1 TIMER channel: 3 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
